# Brewfile — machine dependencies
# Run: brew bundle --file=Brewfile

# === Zsh ===
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eza"

# === JavaScript ===
brew "fnm"
brew "deno"
brew "bun"

# === Dev Tools ===
brew "git"
brew "gh"
brew "git-extras"
brew "jq"
brew "wget"
brew "bat"
brew "tig"
brew "ripgrep"

# === Build Tools ===
brew "rustup"
brew "uv"

# === Infra ===
brew "nmap"

# === Editor ===
brew "vim"

# === CLI Utilities ===
brew "coreutils"
brew "htop"
brew "tree"

# === Video Production ===
brew "yt-dlp"
brew "ffmpeg"

# === Fun ===
brew "cowsay"
brew "fortune"
brew "nyancat"
brew "ponysay"

# === AI ===
brew "ollama"
brew "opencode"
brew "pi-coding-agent"

# === Applications ===
cask "visual-studio-code"
cask "cursor"
cask "google-chrome"
cask "slack"
cask "zoom"
cask "discord"
cask "1password"
cask "1password-cli"
cask "rectangle"
cask "iterm2"
cask "docker-desktop"
cask "vlc"
cask "tailscale"
