# Brewfile — core dependencies
# Run core only: brew bundle --file=Brewfile
# Optional bundles:
#   brew bundle --file=Brewfile.apps
#   brew bundle --file=Brewfile.extras

# === Shell / Prompt ===
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eza"

# === Runtimes ===
brew "fnm"
brew "deno"
brew "bun"
brew "rustup"
brew "uv"

# === Development ===
brew "git"
brew "gh"
brew "git-extras"
brew "jq"
brew "bat"
brew "ripgrep"
brew "tig"
brew "wget"
brew "nmap"

# === Editor ===
brew "vim"

# === CLI Utilities ===
brew "coreutils"
brew "htop"
brew "direnv"
brew "fzf"
brew "zoxide"
brew "tmux"
brew "shellcheck"

# === Core Applications ===
cask "iterm2"
cask "rectangle"
